[
  {
    "question": "Rắn đào hang đỏ (Achalinus rufescens) có nọc độc không?",
    "ground_truth": "Không, Rắn đào hang đỏ là loài không có nọc độc. Răng của chúng thuộc loại aglyphous (không có răng nọc)."
  },
  {
    "question": "Mức độ nguy hiểm của Rắn vảy lạ xám (Achalinus spinalis) đối với con người như thế nào?",
    "ground_truth": "Rắn vảy lạ xám hoàn toàn vô hại đối với con người. Chúng không có nọc độc và nếu bị cắn, vết cắn chỉ gây ra các vết xước nhẹ."
  },
  {
    "question": "Rắn rầm ri cá (Acrochordus granulatus) có độc không?",
    "ground_truth": "Không, Rắn rầm ri cá là loài không có nọc độc (nonvenomous) và hoàn toàn vô hại đối với con người."
  },
  {
    "question": "Rắn rầm ri cóc (Acrochordus javanicus) có nọc độc không?",
    "ground_truth": "Không, Rắn rầm ri cóc là loài không có nọc độc và hoàn toàn vô hại đối với con người."
  },
  {
    "question": "Mức độ nguy hiểm của Rắn roi mõm nhọn (Ahaetulla fusca) đối với con người ra sao?",
    "ground_truth": "Rắn roi mõm nhọn có độc nhẹ và nhìn chung không nguy hiểm nghiêm trọng. Vết cắn thường chỉ gây đau nhẹ, sưng hoặc đỏ tại chỗ."
  },
  {
    "question": "Nọc độc của Rắn roi thường (Ahaetulla prasina) có gây tử vong cho người không?",
    "ground_truth": "Không, nọc độc của Rắn roi thường rất nhẹ, không gây tử vong cho con người. Triệu chứng thường chỉ bao gồm đau cục bộ, sưng, tê và bầm tím tại vết cắn."
  },
  {
    "question": "Rắn roi mắt đỏ (Ahaetulla rufusoculara) có nọc độc không và mức độ nguy hiểm như thế nào?",
    "ground_truth": "Có, Rắn roi mắt đỏ là loài có nọc độc nhẹ. Mức độ nguy hiểm đối với con người rất thấp, thường chỉ gây đau cục bộ, sưng, tê và bầm tím tại vết cắn."
  },
  {
    "question": "Rắn sãi cỏ (Amphiesma stolatum) có độc không?",
    "ground_truth": "Không, Rắn sãi cỏ là loài không có nọc độc và hoàn toàn vô hại đối với con người."
  },
  {
    "question": "Nọc độc của Rắn biển môi xanh (Laticauda laticaudata) thuộc loại gì và mạnh như thế nào?",
    "ground_truth": "Nọc độc của Rắn biển môi xanh thuộc loại độc thần kinh (neurotoxic), mạnh gấp 10 lần rắn đuôi chuông. Tuy nhiên, chúng rất hiền lành và hiếm khi cắn người."
  },
  {
    "question": "Vết cắn của Rắn rào xanh (Boiga cyanea) có gây tử vong không?",
    "ground_truth": "Không, vết cắn của Rắn rào xanh không gây tử vong. Chúng có nọc độc nhẹ, thường chỉ gây triệu chứng cục bộ như đau, sưng và tê."
  },
  {
    "question": "Mức độ nguy hiểm của Rắn rào Quảng Tây (Boiga guangxiensis) đối với con người là gì?",
    "ground_truth": "Rắn rào Quảng Tây có nọc độc nhẹ nhưng được coi là vô hại ở Việt Nam. Vết cắn chỉ gây triệu chứng cục bộ nhẹ và không gây tử vong."
  },
  {
    "question": "Rắn rào ngọc bích (Boiga jaspidea) có được coi là loài nguy hiểm không?",
    "ground_truth": "Không, Rắn rào ngọc bích được coi là vô hại ở Việt Nam. Chúng có nọc độc nhẹ, thường chỉ gây triệu chứng cục bộ và không ghi nhận trường hợp tử vong."
  },
  {
    "question": "Nọc độc của Rắn rào đầu vuông (Boiga kraepelini) có nguy hiểm đến tính mạng không?",
    "ground_truth": "Không, nọc độc của Rắn rào đầu vuông rất nhẹ và không gây tử vong. Triệu chứng khi bị cắn chỉ bao gồm đau cục bộ, sưng nhẹ và đỏ da."
  },
  {
    "question": "Rắn rào đốm (Boiga multomaculata) có độc không?",
    "ground_truth": "Có, Rắn rào đốm là loài có nọc độc nhẹ nhưng được coi là vô hại ở Việt Nam, vết cắn chỉ gây triệu chứng cục bộ nhẹ."
  },
  {
    "question": "Vết cắn của Rắn rào Xiêm (Boiga siamensis) có gây tử vong cho người không?",
    "ground_truth": "Không, Rắn rào Xiêm là loài có nọc độc nhẹ và vết cắn không gây tử vong cho người, thường chỉ gây triệu chứng cục bộ."
  },
  {
    "question": "Nọc độc của Rắn cạp nia (Bungarus candidus) nguy hiểm như thế nào?",
    "ground_truth": "Rắn cạp nia có nọc độc cực mạnh, thuộc loại độc thần kinh. Tỷ lệ tử vong là 60-70% nếu không được điều trị."
  },
  {
    "question": "Nọc độc của Rắn cạp nống (Bungarus fasciatus) thuộc loại gì và tỷ lệ tử vong ra sao?",
    "ground_truth": "Nọc độc của Rắn cạp nống thuộc loại độc thần kinh cực mạnh. Tỷ lệ tử vong từ 50-70% nếu không được điều trị."
  },
  {
    "question": "Rắn mai gầm bắc (Calamaria septentrionalis) có nọc độc không?",
    "ground_truth": "Không, Rắn mai gầm bắc là loài không có nọc độc và hoàn toàn vô hại đối với con người."
  },
  {
    "question": "Mức độ nguy hiểm của Rắn san hô nhỏ đốm (Calliophis maculiceps) như thế nào?",
    "ground_truth": "Mức độ nguy hiểm đối với con người thấp đến trung bình. Vết cắn thường chỉ gây triệu chứng cục bộ và chưa ghi nhận trường hợp tử vong."
  },
  {
    "question": "Nọc độc của Rắn lục mũi hếch (Calloselasma rhodostoma) nguy hiểm ra sao?",
    "ground_truth": "Rắn lục mũi hếch có nọc độc cực mạnh, thuộc loại độc máu (hemotoxic) và là nguyên nhân chính gây tử vong do rắn cắn ở Đông Nam Á, với tỷ lệ tử vong 10-20% nếu không điều trị."
  },
  {
    "question": "Nọc độc của Rắn Séc be (Cerberus schneiderii) thuộc loại gì?",
    "ground_truth": "Rắn Séc be có nọc độc nhẹ, chủ yếu là độc tố gây hại tế bào (cytotoxin) và không gây nguy hiểm cho con người."
  },
  {
    "question": "Rắn nước châu Á (Fowlea piscator) có nọc độc không?",
    "ground_truth": "Không, Rắn nước châu Á là loài không có nọc độc và hoàn toàn vô hại."
  },
  {
    "question": "Rắn cườm (Chrysopelea ornata) có nọc độc không?",
    "ground_truth": "Có, Rắn cườm có nọc độc nhẹ, không gây nguy hiểm đáng kể cho con người."
  },
  {
    "question": "Rắn sọc vàng (Coelognathus flavolineatus) có độc không?",
    "ground_truth": "Không, Rắn sọc vàng là loài không có nọc độc và hoàn toàn vô hại."
  },
  {
    "question": "Mặc dù không có nọc độc, nghiên cứu năm 2003 đã phát hiện ra điều gì về Rắn hổ ngựa (Coelognathus radiatus)?",
    "ground_truth": "Nghiên cứu năm 2003 đã cô lập một loại độc tố thần kinh (neurotoxin) là alpha-colubritoxin từ loài này, chứng minh nguồn gốc sớm của nọc độc ở cả những loài rắn được coi là không độc."
  },
  {
    "question": "Rắn trun (Cylindrophis jodiae) có nọc độc không?",
    "ground_truth": "Không, Rắn trun là loài không có nọc độc và hoàn toàn vô hại."
  },
  {
    "question": "Mức độ nguy hiểm của Rắn trun (Cylindrophis ruffus) là gì?",
    "ground_truth": "Rắn trun là loài không có nọc độc và hoàn toàn vô hại đối với con người."
  },
  {
    "question": "Nọc độc của Rắn lục mũi nhọn (Deinagkistrodon acutus) nguy hiểm như thế nào?",
    "ground_truth": "Đây là loài có nọc độc cực mạnh, thuộc loại độc máu (hemotoxic) và độc tế bào (cytotoxin), có thể gây tử vong với tỷ lệ 10-20% nếu không điều trị."
  },
  {
    "question": "Rắn leo cây Ngân Sơn (Dendrelaphis ngansonensis) có nguy hiểm cho con người không?",
    "ground_truth": "Không, Rắn leo cây Ngân Sơn là loài không có nọc độc và hoàn toàn vô hại."
  },
  {
    "question": "Rắn leo cây bắc Đông dương (Dendrelaphis proarchos) có độc không?",
    "ground_truth": "Không, Rắn leo cây bắc Đông dương là loài không có nọc độc và hoàn toàn vô hại."
  },
  {
    "question": "Rắn leo cây mắt (Dendrelaphis subocularis) có độc không?",
    "ground_truth": "Không, Rắn leo cây mắt là loài không có nọc độc và hoàn toàn vô hại."
  },
  {
    "question": "Nọc độc của Rắn roi nâu (Dryophiops rubescens) thuộc loại gì?",
    "ground_truth": "Rắn roi nâu có nọc độc nhẹ, chủ yếu là độc tố gây hại tế bào (cytotoxin) với yếu tố độc máu (hemotoxic) nhẹ."
  },
  {
    "question": "Rắn sọc gờ (Elaphe carinata) có nọc độc không?",
    "ground_truth": "Không, Rắn sọc gờ là loài không có nọc độc. Tuy nhiên, chúng có tuyến hậu môn tiết ra chất lỏng rất hôi để phòng vệ."
  },
  {
    "question": "Rắn sọc khoanh (Elaphe moellendorffi) có độc tính như thế nào?",
    "ground_truth": "Rắn sọc khoanh là loài không có nọc độc và hoàn toàn vô hại."
  },
  {
    "question": "Rắn sọc đuôi (Elaphe taeniura) có nọc độc không?",
    "ground_truth": "Không, Rắn sọc đuôi là loài không có nọc độc và hoàn toàn vô hại."
  },
  {
    "question": "Nọc độc của Rắn bồng Mekong (Enhydris subtaeniata) thuộc loại gì?",
    "ground_truth": "Rắn bồng Mekong có nọc độc nhẹ, thuộc loại độc tố gây hại tế bào (cytotoxin) với yếu tố độc máu nhẹ, không gây nguy hiểm cho người."
  },
  {
    "question": "Nọc độc của Rắn râu (Erpeton tentaculatum) có nguy hiểm cho người không?",
    "ground_truth": "Không. Rắn râu có nọc độc nhẹ được thiết kế đặc biệt cho cá, không ảnh hưởng đáng kể đến động vật có vú và không gây nguy hiểm cho con người."
  },
  {
    "question": "Rắn ăn cua (Fordonia leucobalia) có nọc độc được thiết kế cho con mồi nào?",
    "ground_truth": "Nọc độc nhẹ của Rắn ăn cua được thiết kế đặc biệt cho cua và cá, không gây nguy hiểm đáng kể cho động vật có vú."
  },
  {
    "question": "Rắn nước đốm vàng (Fowlea flavipunctata) có phải là rắn độc không?",
    "ground_truth": "Không, Rắn nước đốm vàng là loài không có nọc độc và hoàn toàn vô hại."
  },
  {
    "question": "Rắn mũi dài (Gonyosoma boulengeri) có nọc độc không?",
    "ground_truth": "Không, Rắn mũi dài là loài không có nọc độc và hoàn toàn vô hại."
  },
  {
    "question": "Rắn sọc mắt xanh (Gonyosoma coeruleum) có độc không?",
    "ground_truth": "Không, Rắn sọc mắt xanh là loài rắn không có độc tố, hoàn toàn vô hại đối với con người."
  },
  {
    "question": "Rắn dây leo xanh (Gonyosoma frenatum) có nguy hiểm cho con người không?",
    "ground_truth": "Không, Rắn dây leo xanh là loài không có nọc độc và hoàn toàn vô hại."
  },
  {
    "question": "Rắn đuôi đỏ (Gonyosoma oxycephalum) có độc không?",
    "ground_truth": "Không, Rắn đuôi đỏ là loài không có nọc độc và hoàn toàn vô hại."
  },
  {
    "question": "Rắn nước boulengeri (Hebius boulengeri) có nọc độc không?",
    "ground_truth": "Có, Rắn nước boulengeri là loài có nanh sau và nọc độc nhẹ, nhưng không nguy hiểm cho người."
  }
]